Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleProfile
The IFC2X3_ParametricObject_CircleProfile class contains the circular profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleProfile.Radius
The radius.